In [1]:
import pandas as pd

In [1]:

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [2]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
new_row = {"mid":"ggougoi6654",'Name': 'David', 'Age': 28}

In [8]:
new_df = pd.DataFrame(new_row,index =[0])
new_df

    Name  Age
0  David   28

In [13]:
df = pd.concat([df,new_df],ignore_index = True)

In [14]:
# df.to_csv("tempo.csv")

In [15]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [18]:
list(df["Name"])

['Alice', 'Bob', 'Charlie', 'David']

In [3]:
qdata = {"Qid":[],
       "text":[],
       "author":[],
       "mID":[]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

Empty DataFrame
Columns: [Qid, text, author, mID]
Index: []

In [8]:
df.to_csv("./quotes.csv")

In [9]:
df

Empty DataFrame
Columns: [Qid, text, author, mID]
Index: []

In [10]:
aq = df[["author","text"]]

In [11]:
aq

Empty DataFrame
Columns: [author, text]
Index: []

In [16]:

# Create a sample DataFrame
data = {'mid': ['ggougoi6654', 'hjkl9876', 'abcd1234'],
        'Name': ['Alice', 'David', 'Charlie'],
        'Age': [25, 28, 35]}

df = pd.DataFrame(data)

In [18]:
# Search for "David" and retrieve the corresponding "mid"
david_mid = df.loc[df['Name'] == 'David', ['mid',"Age"]]

# Print the "mid" associated with "David"
print(david_mid)

        mid  Age
1  hjkl9876   28

In [19]:
type(david_mid)

pandas.core.frame.DataFrame

In [20]:
print(david_mid.values)

[['hjkl9876' 28]]

In [21]:
5+5

10

In [ ]:
# Search for "David" and retrieve the corresponding "mid"
david_mid = df.loc[df['Name'] == 'David', 'mid'].values[0]

# Print the "mid" associated with "David"
print(david_mid)

In [22]:
df = pd.read_csv("./IDPass.csv")
df

                                    mID        emailID             password
0  56f3d07e-675a-11ee-8612-ff5ae65b72d3        pritesh         Hello@123456
1  d6bc21d0-675a-11ee-8612-ff5ae65b72d3              5         9892901083@a
2  db31d35e-6764-11ee-8612-ff5ae65b72d3           prit          D@123546789
3  ed8616dc-6764-11ee-8612-ff5ae65b72d3            lrb        lrb123456789!
4  f894cdde-6764-11ee-8612-ff5ae65b72d3           dsfg   adf52@4887514dfasd
5  547eee36-6765-11ee-8612-ff5ae65b72d3        Psdfsad   asdf2@q234q2345456
6  5dc2bb76-6765-11ee-8612-ff5ae65b72d3  Pasdfasdfasdf  P@1456dsfsadgfafrga

In [59]:
df = pd.read_csv("./quotes.csv")
df

,Qid,text,author,mID
0,f673fe64-676c-11ee-8612-ff5ae65b72d3,Live life full size,Scorpio,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
1,ffbb9310-676c-11ee-8612-ff5ae65b72d3,Nothing like anything,Micromax,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
2,b2009ed2-677a-11ee-8612-ff5ae65b72d3,I love my India,Dosti,56f3d07e-675a-11ee-8612-ff5ae65b72d3
3,865a85c6-677b-11ee-8612-ff5ae65b72d3,Work is workship,God,56f3d07e-675a-11ee-8612-ff5ae65b72d3

In [63]:
new_df = df[df["mID"] == "56f3d07e-675a-11ee-8612-ff5ae65b72d3"][["author","text"]]

In [64]:
new_df

  author              text
2  Dosti   I love my India
3    God  Work is workship

In [65]:
val = 2

In [40]:
miid = 	"d6bc21d0-675a-11ee-8612-ff5ae65b72d3"

In [68]:
y = new_df.iloc[[0]]
y

  author             text
2  Dosti  I love my India

In [ ]:
"Qid","text","author","mID"

In [58]:
x = df.iloc[[val]].values
x

array([['b2009ed2-677a-11ee-8612-ff5ae65b72d3', nan, 'I love my India',
        'Dosti', '56f3d07e-675a-11ee-8612-ff5ae65b72d3']], dtype=object)

In [51]:
x.values[0]

array(['f673fe64-676c-11ee-8612-ff5ae65b72d3', 'Live life full size',
       'Scorpio', 'd6bc21d0-675a-11ee-8612-ff5ae65b72d3'], dtype=object)

In [49]:
df

,Qid,text,author,mID
0,dee1005e-676b-11ee-8612-ff5ae65b72d3,One step at a time,Unknown,56f3d07e-675a-11ee-8612-ff5ae65b72d3
1,f673fe64-676c-11ee-8612-ff5ae65b72d3,Live life full size,Scorpio,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
2,ffbb9310-676c-11ee-8612-ff5ae65b72d3,Nothing like anything,Micromax,d6bc21d0-675a-11ee-8612-ff5ae65b72d3

In [69]:


# Define column names
columns = ["Qid", "text", "author", "mID"]

# Create an empty DataFrame with specified headers
df = pd.DataFrame(columns=columns)

df.to_csv("./quotes.csv")

In [28]:
import pandas as pd

# Create a sample DataFrame
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}

df = pd.DataFrame(data)

In [29]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:

# Select a single element (row 0, column 1)
element = df.iloc[0, 1]  # element is 4
element

4

In [32]:

# Select a single column (column 2)
column = df.iloc[:, 2]  # column is a Series containing [7, 8, 9]
column

0    7
1    8
2    9
Name: C, dtype: int64

In [33]:
# Select a subset of rows and columns
subset = df.iloc[1:3, 0:2]  # subset is a DataFrame containing rows 1 and 2, and columns 0 and 1

In [34]:
subset

   A  B
1  2  5
2  3  6

In [70]:
df = pd.read_csv("./quotes.csv")
df

Empty DataFrame
Columns: [Qid, text, author, mID]
Index: []

In [96]:
data = [
    {"Qid": 1, "text": "Sample text 1", "author": "Author A", "mID": "ID001"},
    {"Qid": 2, "text": "Sample text 2", "author": "Author B", "mID": "ID002"},
    {"Qid": 3, "text": "Sample text 3", "author": "Author C", "mID": "ID003"},
    {"Qid": 4, "text": "Sample text 4", "author": "Author D", "mID": "ID004"},
    # Add more rows as needed
]

In [97]:
df = pd.DataFrame(data)

In [100]:
df.set_index("mID")

       Qid           text    author
mID
ID001    1  Sample text 1  Author A
ID002    2  Sample text 2  Author B
ID003    3  Sample text 3  Author C
ID004    4  Sample text 4  Author D

In [101]:
df.to_csv("./quotes1.csv")

In [106]:
df = pd.read_csv("./quotes1.csv")

In [107]:
df

   Unnamed: 0  Qid           text    author    mID
0           0    1  Sample text 1  Author A  ID001
1           1    2  Sample text 2  Author B  ID002
2           2    3  Sample text 3  Author C  ID003
3           3    4  Sample text 4  Author D  ID004

In [108]:
len(df)

4

In [109]:
data = {"Qindex":1 ,
                 "Qid":2,
                "text":3,
                "author":4,
                "mID":5
                }
df = pd.DataFrame(data,index=[0])

In [110]:
df

   Qindex  Qid  text  author  mID
0       1    2     3       4    5

In [112]:
df.to_csv("./quotes.csv")

In [113]:
quotes_df = pd.read_csv("./quotes.csv",index_col=0)

In [114]:
quotes_df

,Qid,text,author,mID
0,f0e0e246-678f-11ee-8612-ff5ae65b72d3,Heyy Vaish,v,56f3d07e-675a-11ee-8612-ff5ae65b72d3
1,f728655c-678f-11ee-8612-ff5ae65b72d3,not now,v,56f3d07e-675a-11ee-8612-ff5ae65b72d3
2,08fc7b6a-6790-11ee-8612-ff5ae65b72d3,then when,S,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
3,1749661a-6790-11ee-8612-ff5ae65b72d3,abhi nahi to kabhi nahi,s1,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
4,3ff602bc-6790-11ee-8612-ff5ae65b72d3,hello myself,joker,56f3d07e-675a-11ee-8612-ff5ae65b72d3

In [118]:
quotes_df[quotes_df["mID"] == "56f3d07e-675a-11ee-8612-ff5ae65b72d3"].reset_index().set_index("index")

,Qid,text,author,mID
index,,,,
0,f0e0e246-678f-11ee-8612-ff5ae65b72d3,Heyy Vaish,v,56f3d07e-675a-11ee-8612-ff5ae65b72d3
1,f728655c-678f-11ee-8612-ff5ae65b72d3,not now,v,56f3d07e-675a-11ee-8612-ff5ae65b72d3
4,3ff602bc-6790-11ee-8612-ff5ae65b72d3,hello myself,joker,56f3d07e-675a-11ee-8612-ff5ae65b72d3

In [139]:
df = pd.read_csv("./IDPass.csv")
x = df.loc[df["mID"] =="56f3d07e-675a-11ee-8612-ff5ae65b72d3","emailID" ]
x.values[0]

'pritesh'

In [140]:
df

                                    mID        emailID             password
0  56f3d07e-675a-11ee-8612-ff5ae65b72d3        pritesh         Hello@123456
1  d6bc21d0-675a-11ee-8612-ff5ae65b72d3              5         9892901083@a
2  db31d35e-6764-11ee-8612-ff5ae65b72d3           prit          D@123546789
3  ed8616dc-6764-11ee-8612-ff5ae65b72d3            lrb        lrb123456789!
4  f894cdde-6764-11ee-8612-ff5ae65b72d3           dsfg   adf52@4887514dfasd
5  547eee36-6765-11ee-8612-ff5ae65b72d3        Psdfsad   asdf2@q234q2345456
6  5dc2bb76-6765-11ee-8612-ff5ae65b72d3  Pasdfasdfasdf  P@1456dsfsadgfafrga
7  21c2926c-6793-11ee-8612-ff5ae65b72d3          dilip            D!1234567

In [141]:
df.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7]

In [126]:
df.loc[df[df["mID"] =="56f3d07e-675a-11ee-8612-ff5ae65b72d3" ].index,"emailID" ]

0    pritesh
Name: emailID, dtype: object

In [127]:
data = {"mID":[],
       "Qid":[]}

In [128]:
df = pd.DataFrame(data)
df

Empty DataFrame
Columns: [mID, Qid]
Index: []

In [129]:
df.to_csv("./favouriteQuotes.csv")

In [135]:
data = {'A': 2,
        'B': 1}

In [137]:
df = pd.DataFrame(data,index = [0])

In [138]:
df

   A  B
0  2  1

In [134]:
type(df.loc[1,"B"])

numpy.int64

In [144]:
df = pd.read_csv("./quotes.csv",index_col=0)

In [146]:
df.reindex()

,Qid,text,author,mID
0,08fc7b6a-6790-11ee-8612-ff5ae65b72d3,then when,S,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
1,1749661a-6790-11ee-8612-ff5ae65b72d3,abhi nahi to kabhi nahi,s1,d6bc21d0-675a-11ee-8612-ff5ae65b72d3
2,c9b3b088-6792-11ee-8612-ff5ae65b72d3,tomorrow is big,big,56f3d07e-675a-11ee-8612-ff5ae65b72d3
3,3a760d52-6793-11ee-8612-ff5ae65b72d3,I am King,Di,21c2926c-6793-11ee-8612-ff5ae65b72d3
5,b9979030-67a0-11ee-8612-ff5ae65b72d3,This is my new begining,new,8f09ff42-67a0-11ee-8612-ff5ae65b72d3
6,e1655a0c-67a0-11ee-8612-ff5ae65b72d3,Hey folks Please like this,new,8f09ff42-67a0-11ee-8612-ff5ae65b72d3

In [149]:
df.loc[6].tolist()

['e1655a0c-67a0-11ee-8612-ff5ae65b72d3',
 'Hey folks Please like this',
 'new',
 '8f09ff42-67a0-11ee-8612-ff5ae65b72d3']

In [3]:
import re
import pandas as pd

In [16]:
pattern = re.compile("^[a-z]+[0-9]*@[a-z]+\\.(com)|(net)|(in)|(org)$")

In [6]:
df = pd.read_csv("./IDPass.csv",index_col=0)

In [7]:
df

                                            emailID             password
mID
56f3d07e-675a-11ee-8612-ff5ae65b72d3        pritesh         Hello@123456
d6bc21d0-675a-11ee-8612-ff5ae65b72d3              5         9892901083@a
db31d35e-6764-11ee-8612-ff5ae65b72d3           prit          D@123546789
ed8616dc-6764-11ee-8612-ff5ae65b72d3            lrb        lrb123456789!
f894cdde-6764-11ee-8612-ff5ae65b72d3           dsfg   adf52@4887514dfasd
547eee36-6765-11ee-8612-ff5ae65b72d3        Psdfsad   asdf2@q234q2345456
5dc2bb76-6765-11ee-8612-ff5ae65b72d3  Pasdfasdfasdf  P@1456dsfsadgfafrga
21c2926c-6793-11ee-8612-ff5ae65b72d3          dilip            D!1234567
8f09ff42-67a0-11ee-8612-ff5ae65b72d3            new           new.123456

In [17]:
lists = ["prite@gmail.com","prite1@gmail.com", "1rahul@gmail.com","prit@java.net","om1@o.com","omkar@21.org","pRat78@ymail.com","notdot@googlecom"]

In [18]:
for i in lists:
    if pattern.search(i):
        print(f"{i} is Valid")
    else:
        print(f"{i} is InValid")

prite@gmail.com is Valid
prite1@gmail.com is Valid
1rahul@gmail.com is InValid
prit@java.net is Valid
om1@o.com is Valid
omkar@21.org is Valid
pRat78@ymail.com is InValid
notdot@googlecom is InValid

In [ ]:
p_pattern = re.compile("[a-z]+[0-9]+")